
## Plan Result (transactional-emails-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/73764)


<pre><code>Plan: 1 to add, 8 to change, 0 to destroy.</code></pre>

* Create
  * aws_sns_topic_subscription.ForgotPassword-Topic-sns-subscription
* Update
  * aws_codedeploy_app.events_sqs-event-consumer_lambda-code-deploy_code-deploy-app_7EC26991
  * aws_codedeploy_deployment_group.events_sqs-event-consumer_lambda-code-deploy_code-deployment-group_BF92F57F
  * aws_iam_role.events_sqs-event-consumer_lambda-code-deploy_code-deploy-role_4FCF08D9
  * aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sqs_queue_policy.transactional-email-sns-dlq-policy
  * aws_sqs_queue_policy.transactional-email-sns-sqs-policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_codedeploy_app.events_sqs-event-consumer_lambda-code-deploy_code-deploy-app_7EC26991 will be updated in-place
  ~ resource "aws_codedeploy_app" "events_sqs-event-consumer_lambda-code-deploy_code-deploy-app_7EC26991" {
        id               = "aa972051-f1ba-4d04-ae8a-b585123cb1a4:TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda"
        name             = "TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda"
        tags             = {}
      ~ tags_all         = {
          + "environment" = "Prod"
          + "service"     = "TransactionalEmails"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.events_sqs-event-consumer_lambda-code-deploy_code-deployment-group_BF92F57F will be updated in-place
  ~ resource "aws_codedeploy_deployment_group" "events_sqs-event-consumer_lambda-code-deploy_code-deployment-group_BF92F57F" {
        id                          = "977bbab8-79dc-406c-8dc2-8ef9fffa78b9"
        tags                        = {}
      ~ tags_all                    = {
          + "environment" = "Prod"
          + "service"     = "TransactionalEmails"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_role.events_sqs-event-consumer_lambda-code-deploy_code-deploy-role_4FCF08D9 will be updated in-place
  ~ resource "aws_iam_role" "events_sqs-event-consumer_lambda-code-deploy_code-deploy-role_4FCF08D9" {
        id                    = "TransactionalEmails-Prod-Sqs-Event-Consumer-CodeDeployRole"
        name                  = "TransactionalEmails-Prod-Sqs-Event-Consumer-CodeDeployRole"
        tags                  = {}
      ~ tags_all              = {
          + "environment" = "Prod"
          + "service"     = "TransactionalEmails"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8 will be updated in-place
  ~ resource "aws_lambda_function" "events_sqs-event-consumer_lambda_3BE960B8" {
        id                             = "TransactionalEmails-Prod-Sqs-Event-Consumer-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:TransactionalEmails-Prod-Sqs-Event-Consumer-Function:439" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:TransactionalEmails-Prod-Sqs-Event-Consumer-Function:439/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "TransactionalEmails"
        }
      ~ version                        = "439" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                            = (sensitive value)
                # (6 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:TransactionalEmails-Prod-Infrastructure-Alarm-Critical"
        name                                     = "TransactionalEmails-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "environment" = "Prod"
          + "service"     = "TransactionalEmails"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:TransactionalEmails-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "TransactionalEmails-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "environment" = "Prod"
          + "service"     = "TransactionalEmails"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.ForgotPassword-Topic-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ForgotPassword-Topic-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:TransactionalEmails-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPassword-Topic"
    }

  # aws_sqs_queue_policy.transactional-email-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                    # (2 unchanged elements hidden)
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic",
                                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPassword-Topic",
                                ]
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.transactional-email-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/TransactionalEmails-Prod-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                    # (2 unchanged elements hidden)
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic",
                                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPassword-Topic",
                                ]
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 8 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"6ad0d4dd-1ab0-41f0-98ba-b601a82e0175","JobName":"transactional-emails_infrastructure_plan_prod","PRNumber":249,"Program":"tfcmt","SHA1":"a77e0c005aacdb24702ef79fa550731cb20b7075","Target":"transactional-emails-cdk","Vars":{}} -->